spec/dummy/app/controllers/chickens_controller.rb

SELECT "apples".* FROM "apples" WHERE "apples"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_chickens
    @apple = Apple.find(params[:apple_id])

SELECT "chickens".* FROM "chickens" WHERE "chickens"."apple_id" = 1 AND "chickens"."id" = ? LIMIT 1  [["id", "5"]]
---
  def set_chicken
    @apple = Apple.find(params[:apple_id])

    if action_name =~ /new|create/
      @chicken = @apple.chickens.new(params[:chicken])
    else
      @chicken = @apple.chickens.find(params[:id])